stianeklund/RemoteRadioDisplay/sdkconfig.defaults.esp32p4
# ESP32-P4 specific configuration (Guition JC-ESP32P4-M3 + 5" DSI 720x1280)

CONFIG_IDF_TARGET="esp32p4"

# CPU frequency: 360MHz (P4 max)
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_360=y

# SPIRAM: 32MB PSRAM on Guition board
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

# WiFi Remote via ESP32-C6 coprocessor (SDIO transport)
CONFIG_ESP_WIFI_REMOTE_ENABLED=y
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y

# P4 bootloader is larger than S3 - use size optimization to fit
CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_SIZE=y

# I2C ISR IRAM-safe
CONFIG_I2C_ISR_IRAM_SAFE=y

# CAT UART: GPIO1 (TX) / GPIO2 (RX) on Guition Expand IO header (JP1 pins 7/9)
CONFIG_CAT_UART_TX_PIN=1
CONFIG_CAT_UART_RX_PIN=2
